app/controllers/api/v1/tags_controller.rb

  def index
    tags = paginate(Tag.all)
---
SELECT "tags".* FROM "tags" LIMIT ? OFFSET ?  [["LIMIT", 9], ["OFFSET", 0]]

  def create
    tag = Tag.new(tag_param)
    tag.save!
---
INSERT INTO "tags" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Home3"], ["created_at", "2021-08-09 23:38:23.846942"], ["updated_at", "2021-08-09 23:38:23.846942"]]

  def update
    tag = Tag.find(params[:id])
---
SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]