app/controllers/api/v1/tasks_controller.rb

SELECT "tags".* FROM "tags" INNER JOIN "tags_tasks" ON "tags"."id" = "tags_tasks"."tag_id" WHERE "tags_tasks"."task_id" = ?  [["task_id", 1]]
---
  def index
    tasks = paginate(Task.all.includes(:tags))