app/controllers/api/v1/tasks_controller.rb

SELECT "tasks".* FROM "tasks" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    tasks = paginate(Task.all)

INSERT INTO "tasks" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "testing123"], ["created_at", "2021-08-10 01:03:20.364080"], ["updated_at", "2021-08-10 01:03:20.364080"]]
---
    task = Task.new(task_param)
    Task.transaction do
      if task.save!

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
    task = Task.find(params[:id])

SELECT "tags".* FROM "tags" WHERE "tags"."title" = ? LIMIT ?  [["title", "Home"], ["LIMIT", 1]]
INSERT INTO "tags" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "hello"], ["created_at", "2021-08-10 02:49:23.869341"], ["updated_at", "2021-08-10 02:49:23.869341"]]
INSERT INTO "tags_tasks" ("task_id", "tag_id") VALUES (?, ?)  [["task_id", 3], ["tag_id", 1]]
SELECT "tags".* FROM "tags" WHERE "tags"."title" = ? LIMIT ?  [["title", "Urgent"], ["LIMIT", 1]]
SELECT 1 AS one FROM "tags" WHERE "tags"."title" = ? LIMIT ?  [["title", "Home3"], ["LIMIT", 1]]
INSERT INTO "tags" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Ravi"], ["created_at", "2021-08-10 03:42:02.459684"], ["updated_at", "2021-08-10 03:42:02.459684"]]
INSERT INTO "tags_tasks" ("task_id", "tag_id") VALUES (?, ?)  [["task_id", 3], ["tag_id", 8]]
---
  def find_or_create_tags(param_tags = [], task)
    param_tags.each do |tag_param|
      tag = Tag.find_by_title(tag_param)
      if tag.nil?
        task.tags.create(title: tag_param)
      else
        task_tags = task.tags.collect(&:title).include?(tag.title)
        unless task_tags
          task.tags << tag